test-calls/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:gs="flightsSchema.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getFlightRequest>
	      <gs:flightId>Spain</gs:flightId>
	      <gs:flightDate>test</gs:flightDate>
      </gs:getFlightRequest>
   </soapenv:Body>
</soapenv:Envelope>
